Autodesk.Navisworks.Api.ClipPlaneAlignment
Alignment of a clip plane.

Autodesk.Navisworks.Api.ClipPlaneAlignment.None
Not aligned

Autodesk.Navisworks.Api.ClipPlaneAlignment.View
Aligned with the view

Autodesk.Navisworks.Api.ClipPlaneAlignment.Back
Aligned to the back

Autodesk.Navisworks.Api.ClipPlaneAlignment.Front
Aligned to the front

Autodesk.Navisworks.Api.ClipPlaneAlignment.Left
Aligned to the left

Autodesk.Navisworks.Api.ClipPlaneAlignment.Right
Aligned to the right

Autodesk.Navisworks.Api.ClipPlaneAlignment.Top
Aligned to the top

Autodesk.Navisworks.Api.ClipPlaneAlignment.Bottom
Aligned to the bottom

Autodesk.Navisworks.Api.ClipPlaneAlignment.Surface
Aligned with a surface

Autodesk.Navisworks.Api.ClipPlaneAlignment.Line
Aligned with a line

Autodesk.Navisworks.Api.ClipPlaneAlignment.Custom
Custom alignment